Autodesk.Revit.DB.FamilyManager.IsUserAssignableParameterGroup(Autodesk.Revit.DB.ForgeTypeId)
Checks if the given parameter group can be assigned to new parameters.
Returns:
True if the parameter group can be assigned to new parameters, false otherwise.
Since: 2015

Autodesk.Revit.DB.FamilyManager.ReplaceParameter(Autodesk.Revit.DB.FamilyParameter,System.String,Autodesk.Revit.DB.ForgeTypeId,System.Boolean)
Replace a shared family parameter with a new non-shared family parameter.
currentParameter: The current family parameter.
parameterName: The name of the new family parameter.
groupTypeId: The identifier of the group to which the new family parameter belongs.
isInstance: Indicates if the new parameter is instance or type.
Returns: If replacement was successful the new family parameter is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"currentParameter" or "parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"currentParameter"-is invalid,
or the input parameter group cannot be assigned to the new parameter,
or the input name string contains illegal characters, or duplicated with existing parameter name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to replace a built-in parameter or family parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when replacement failed, because the replacement would cause a formula error.
Or trying to replace with an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.ReplaceParameter(Autodesk.Revit.DB.FamilyParameter,Autodesk.Revit.DB.ExternalDefinition,Autodesk.Revit.DB.ForgeTypeId,System.Boolean)
Replace a family parameter with a shared parameter.
currentParameter: The current family parameter.
familyDefinition: The definition of the loaded shared parameter.
groupTypeId: The identifier of the group to which the new shared parameter belongs.
isInstance: Indicates if the new parameter is instance or type.
Returns: If replacement was successful the new shared parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This operation is invalid for Built-in Parameters.
The formulas and labels which in reference to this parameter will be updated to the new parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter" or "name"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is invalid,
or the input parameter group cannot be assigned to the new parameter,
or the input name string contains illegal characters, or duplicated with existing parameter name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to replace a built-in parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when replacement failed, because the replacement would cause a formula error.
Or trying to replace with an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AddParameter(System.String,Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.Category,System.Boolean)
Add a new family type parameter to control the type of a nested family within another family.
parameterName: The name of the new family parameter.
groupTypeId: The identifier of the group to which the family parameter belongs.
familyCategory: The category to which the new family parameter binds.
isInstance: Indicates if the new family parameter is instance or type.
Returns: If creation was successful the new parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"parameterName"-is already in use,
or the input parameter group cannot be assigned to the new parameter,
or the input argument-"familyCategory"-is illegal to bind with parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the required family of familyCategory is not existing in current document,
, or when the creation failed.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AddParameter(System.String,Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId,System.Boolean)
Add a new family parameter with a given name.
parameterName: The name of the new family parameter.
groupTypeId: The identifier of the new family parameter's parameter group.
specTypeId: The type of new family parameter.
isInstance: Indicates if the new family parameter is instance or type.
Returns: If creation was successful the new parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
To add a parameter of family type use the AddParameter overload that accepts a category instead.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"parameterName"-is already in use,
or when the input argument -"specTypeId" is an invalid type,
or the input parameter group cannot be assigned to the new parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter creation failed.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AddParameter(Autodesk.Revit.DB.ExternalDefinition,Autodesk.Revit.DB.ForgeTypeId,System.Boolean)
Add a new parameter to the family.
Add a new shared parameter to the family.
familyDefinition: The definition of the loaded shared parameter.
isInstance: Indicates if the new parameter is instance or type.
groupTypeId:  The identifier of the parameter group to which the family parameter belongs.
Returns: If creation was successful the new shared parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input parameter group cannot be assigned to the new parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the shared family parameter creation is not supported.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.GetParameter(Autodesk.Revit.DB.ForgeTypeId)
Obtains the family parameter with the given built-in parameter identifier.
Remarks: Returns null if the parameter is not found.
parameterTypeId: Identifier of the built-in parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since: 2022